Revit 2027 API
DuctFlowConfigurationType Enumeration
An enumerated type listing all duct flow configuration types for a connector.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum DuctFlowConfigurationType
Public Enumeration DuctFlowConfigurationType
public enum class DuctFlowConfigurationType
type DuctFlowConfigurationType
Members
Member name | Value | Description
Calculated | 0 | Duct flow configuration is calculated.
Preset | 1 | Duct flow configuration is preset.
System | 2 | Duct flow configuration depends on system.
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace